{
  "items": [
    {
      "id": "art001",
      "title": "Что такое SPA и как оно работает",
      "author": "Алексей Смирнов",
      "content": "Одностраничное приложение (SPA) — это тип веб-приложения, при котором весь интерфейс загружается один раз, а дальнейшая навигация выполняется без перезагрузки страницы. Вместо запроса новой HTML-страницы браузер обновляет только нужные части интерфейса. Благодаря этому достигается высокая скорость работы и плавность взаимодействия пользователя с сайтом."
    },
    {
      "id": "art002",
      "title": "Основы клиент–серверной архитектуры",
      "author": "Мария Ковалева",
      "content": "Клиент–серверная архитектура — это модель взаимодействия, при которой клиент запрашивает данные или услуги, а сервер отвечает на эти запросы. Клиентом может быть браузер, мобильное приложение или даже другой сервер. Сервер обрабатывает запрос, выполняет логику и отправляет ответ. Эта архитектура лежит в основе всех современных веб-приложений."
    },
    {
      "id": "art003",
      "title": "Как работать с REST API в JavaScript",
      "author": "Илья Петров",
      "content": "REST API позволяет приложениям обмениваться данными через стандартные HTTP-запросы: GET, POST, PUT, PATCH, DELETE. В JavaScript чаще всего используется функция fetch(). С её помощью можно отправлять запросы на сервер, получать JSON-ответы и обновлять интерфейс без перезагрузки страницы. REST API является ключевым инструментом при создании динамических веб-приложений."
    },
    {
      "id": "art004",
      "title": "Как работает хэш-роутинг в веб-приложениях",
      "author": "Никита Соколов",
      "content": "Хэш-роутинг использует часть URL после символа #. Эта часть не отправляется на сервер, что позволяет управлять навигацией полностью на стороне клиента. Изменение hash вызывает событие hashchange, на которое может реагировать приложение. Благодаря этому можно реализовать переключение страниц в SPA без серверной конфигурации."
    },
    {
      "id": "art005",
      "title": "Как устроен JSON-Server",
      "author": "Екатерина Орлова",
      "content": "JSON-Server — это инструмент, который превращает обычный JSON-файл в полноценный REST API. Он поддерживает запросы GET, POST, PUT, PATCH и DELETE, автоматически обновляет данные внутри файла и позволяет мгновенно создать сервер для тестирования или разработки. Это отличный выбор для учебных проектов и прототипов."
    }
  ]
}
